Revit 2024 API
ParameterTypeId.AlignmentStationLabelSetOffset Property
 "Alignment Station Label Set Offset": The text is not used directly anywhere in the UI, instead the XAML specifies its own string for the value's label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AlignmentStationLabelSetOffset { get; }
Visual Basic
Public Shared ReadOnly Property AlignmentStationLabelSetOffset As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AlignmentStationLabelSetOffset {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace